from telegram import ReplyKeyboardMarkup, InlineKeyboardButton, InlineKeyboardMarkup

# تنظیمات اولیه
delete_time = 30  # زمان پیش‌فرض برای حذف پیام‌ها (به ثانیه)

# منوی اصلی برای کاربران عادی
main_menu = [
    ["پروفایل 👤", "خبرنامه 🔔"]
]

# منوی ادمین
admin_menu = [
    ["مدیریت فایل 📁", "مدیریت کانال‌ها 📢"],
    ["ارسال پیام همگانی 📤", "تنظیمات ⚙️"],
    ["مدیریت کاربران 👥", "پروفایل 👤"],
    ["خبرنامه 🔔"]
]

# منوی مدیریت فایل
file_menu = [
    ["آپلود فایل 📤", "حذف فایل 🗑️"],
    ["زمان‌بندی فایل 📅", "فیلتر فایل‌ها 📂"],
    ["🔙 بازگشت"]
]

# منوی مدیریت کانال‌ها
channel_menu = [
    ["افزودن کانال ➕", "حذف کانال ➖"],
    ["🔙 بازگشت"]
]

# منوی حذف فایل
remove_file_menu = [
    ["با ID 🆔", "با فایل 📂"],
    ["🔙 بازگشت"]
]

# منوی تنظیمات
settings_menu = [
    ["زمان حذف پیام‌ها ⏳", "پیام خوش‌آمدگویی 📝"],
    ["تنظیمات خبرنامه 🔔"],
    ["🔙 بازگشت"]
]

# منوی بدون کپشن
no_caption_menu = [
    [InlineKeyboardButton("بدون کپشن", callback_data="no_caption")]
]